-- tutorial popup definitions
-- format: {name = { { "text to show to user", { highlight_x, highlight_y, highlight_size } } } }
-- the highlight are fractions of the screen (so 0..1) - set to 0 to disable
-- text supports $controlName escapes which will be replaced by the key bound to that control

{
   intro_help = {
      { "...滋滋...", 0},
	  { "未知信号：侦测到未知生命体正在进入宇宙。", 0},
	  { "未知信号：目标已锁定,正在扫描", 0},
	  { "未知信号：扫描完成。", 0},
	  { "... ...", 0},
	  { "^5U??-????^7：这里是INR主力舰,你来到了一个反常的宇宙空间。", 0},
	  { "^5U??-????^7：我们不知道你属不属于[解码失败],但是你的构造与我们所见过的任何生命体都不同", 0},
	  { "^5U??-????^7：如果你属于[解码失败],那么,组建你自己的舰队吧。", 0},
	  { "^5U??-????^7：记住,我们不知道你是谁,也不知道你在哪里,若你不属于[解码失败]舰队,请勿靠近我们的领地。", 0},
	  { "^5U??-????^7：或许你应该看一下这个？", 0},
	  { "^1[信号被屏蔽]^7", 0},
	  { "--- --- ---", 0},
	  { "--&Þ¿*^&*%^--", 0},
	  { "？？？：已拦截^5[解码失败]^7讯息", 0},
	  { "？？？：嗯...^5[解码失败]^7到底是怎么把这些奇怪文本发送给这些舰船的？", 0},
	  { "？？？：这里是[...滋滋...],不要听^5[解码失败]^7说的那些话，它们被奇怪的东西污染了...", 0},
	  { "……信号消失……", 0},
      { "#自动备忘录#：请使用 ’$viewMap’ 放大小地图。", {0.075, 0.125, 0.075}},
      { "#自动备忘录#：请使用 $zoom 来放大或缩小视角。", 0 },
	  { "#自动备忘录#：右下角是教程任务。", {0.9, 0.1, 0.1}},
    },

   intro2_help = {
      { "信号接收中...25%", 0}
	  { "60%", 0}
	  { "？？？：刚刚我探测到了一些奇怪的东西", 0}
      { "？？？：宇宙中心出现了强烈的不稳定的能量波动,不过目前看起来什么奇怪的东西都没出现。...不对，那里好像出现了一些奇怪的构造体...貌似不属于我们所发现的任何4%&^*%4...5@!@23.2.4..21.0..1.1", {0.075, 0.125, 0.075} },
      { "......", 0 }
	  { "..滋滋...^1信号已断开^7", 0},
	  { "通讯器故障..检测中...", 0}
      { "故障原因：^1不稳定能量爆发^7", 0}
      { "[通信中断]", 0}
	  { "#自动备忘录#:[使用 [默认键]^2G^7 控制你的舰队攻击目标]", 0 },
	  { "#自动备忘录#:[使用^2$mouseRotToggle^7改变你的舰船操控模式]", 0 },
	},

   res_full_help = {
      { "#自动备忘录#：你的舰船无法再容纳更多的^6R^7了。多放一些货仓增加载荷,或靠近生成点飞行,用^6R^7换取^3C^7。", {0.1, 0.25, 0.05} }
    },

   constructor_popup_help = {
	  {"##读取备忘录中##",0},
      { "#自动备忘录#:^1从元件板上拖动新模块来设计 改造你的舰船^7" , {0.85, 0.6, 0.25} },
      { "#自动备忘录#:’^5P^7’的值限制着舰船的各项功能,你应该提高^5P^7值来让你的舰船变得更强大。不过,别忘了按’$viewUpgrades’打开升级界面然后使用^3C^7购买零件。", {0.05, 0.95, 0.05} },
	  { "#自动备忘录#:实际上，一些高^5P^7的武器效果会比低^5P^7的武器更好，在同^5P^7状态下。", 0}
	  { "#自动备忘录#:你可以选择先购买完所有或大部分零件再添加^5P^7，或者是先添加一定的^5P^7再去买零件。", 0}
      { "#自动备忘录#:在“^5帮助^7”菜单中查看键盘命令, 包括方块如何翻转、 改变方块尺寸等。 ", {0.025, 0.025, 0.025} },
      { "#自动备忘录#:完成后点击^4退出^7, 直接改动武器绑定信息不会被保存, 需要修改舰船上的模块或重新命名等。", {0.875, 0.05, 0.05} }
    },

   upgrade_help = {
      { "#自动备忘录#:这里是升级界面", 0}
	  { "#自动备忘录#:在升级界面里花费^3C^7购买零件", 0}
      { "#自动备忘录#:增加^5P^7以建造更大的舰船或收集C招募一个舰队。", { 0.25, 0.75, 0.1 } }, -- overridden in code
   },

   intro_gravity = {
      { "#自动备忘录#：看起来你进入了一个恒星轨道。在围绕恒星向轨道推进时,加速将增加你的轨道大小,减速将减小轨道大小", 0}
      { "#自动备忘录#：小心不要撞上恒星。", 0},
   },
}
