-- game tip definitions
-- these are randomly shown to the player on the pause screen, while loading save games, etc

{
   "配有.#^!#$^1武器^7..2@%@$模块1#%134%6自动与空1@#^站交易^6R^7 。此#!%^要使...^3'$transferRes'^7进行!@#$%??。",

   "按下'$mouseRotToggle'键@!#%????!104-模式。",

   "按下'$autoZoomToggle'键来完#%!虚#%!@##放，或者!@$廿@!!01045-22-v按下'$oid...!@^!@##弑#%@!((*&用。",

   "按下 '$toggleHUD' 键@%!^#!NAV板界@$Y面。还可@%$#!藏!!!任务。",

   "通过生成一!%600....加载中...!@%#%!@建造新的..点。 你新!@#$^$!活生@%24%使2$6你的@%1设^!3@$^生$%@32船。",

   "己方????具有建@!$的飞??会从34^#$^的舰1%#^1157面里&^#6179飞船蓝图。",

   "进入升级界面（ '$view???????ades' ）来增加!#^#!#@#^5pp!^7@3^`2#@5^7新模块，让你的飞船更加强大。",

   "发!!!机!@^为武..虚空..电力，但被摧#!%会剧5%%EXPL——请注####错误###保护它们。",

   "在主!%&&?控制选项中2%!不!^!@可@%键绑定。",

   "在指挥模1^%!@^1敌^7方飞船并按下'$viewSelector'，可编辑它的设计或者更..子...^1摧毁此飞^7船$%@^!???..???。",

   "小心^1虚空之影^7....，它们%^@!%^1错误^7!#$2高的.....^1攻击力^7甲????。",

   "一些^1FXTY...^5军..!#$团???^3??????^5^7!#$@101^1错误^7..舰船可以布置???? ^1核弹^&??#5!1???。",

   "xzadudu179曾试图把??传到创意工坊，但失败了。",

   "重组-虚空是一个???种族的mod，种族相克，评价一下？",

   "????的舰船有一大部分都是 真夏の不融の氷 做的，179的舰船风格和9的风格并不同，很可能会在游戏里看到两种类型的舰队。",

   "??的导弹很强大，最好多放一些点防炮塔",

   "^4????的舰船是很漂亮的^1红^0黑^4配色！",

   "重组虚空的前缀“RST”没有意思也没有作用",

   "你可以在xzadudu179的mods文件夹里看到一大堆模组历史版本压缩文件",

   "不要把re玩成^1奇怪的游戏^7！",

   "真菌的舰载机甚至会被当做系统船刷在^5地图^7和^5测试界面^7上...",

   "其实做了这个mod以后re已经被玩成奇怪的游戏了）",

   "有几个小更新有彩蛋..",

   "这个mod应该改名为reassssssssssssssssembly（？）",

   "虽然重组-虚空和reassembly-void是同一个名字，但是它们不是同一个mod！第二个虚空是虚空之影！",

   "这mod看着就很imba",

   "真菌的船是不是有点太多了",

   "这个mod改了非常非常多的cvars，ai可能变得更聪明了！",

   "代理人舰队的p值被我改到了45000",

   "其实我在做这个mod的时候根本不知道代理人舰队就是特种舰队",

   "好像这个mod里的特种舰队不叫特种舰队？",

   "我应该在写提示的时候打乱顺序的..",

   "void和void不是一个东西，虚空和虚空也不是一个东西",

   "死亡重生加载界面太慢啦！",

   "re是个奇怪的游戏",

   "reassemblyreassemblyreassembly.....",

   "只要我的tips够多，就没有人能看完我的tips！",

   "玩void的时候小心电脑爆炸",

   "re ass embly",

   "reassempty",

   "重组世界难道不是微观世界嘛？",

   "^1r^2e^3a^4s^5s^6e^7m^8b^1l^2y",

   "原版的8000p船是主力舰，而void里的8000p船只是巡洋舰",

   "其实军团就是哨兵",

   "去翻翻模组源文件，里面有一些东西可以看",

   "我也不知道我加了多少个tips，不过目前应该很少（）",

   "啊这些tips怎么转英文",

   "菌类最大的空间站有100000p",

   "所有的激光武器都不会被镜子反射的",

   "灵魂族的大部分船都用的一些废弃种族的名称",

   "灵魂族太imba了",

   "这个mod看着就很蔡",

   "其实我一直在水tips",

   "代理人舰队不是根据你的设置刷新的（屑官方）",

   "为什么reassembly没有多人模式",

   "''''''''''",

   "目前只有中文版能看到这些tips（）",

   "可能十年之后我才会把这个mod发到steam上",

   "英文翻译好难做呜呜呜",

   "打乱顺序打乱顺序",

   "好像没人看我的tips呢",

   "以后一定要强制让别人看我的tips（",

   "_-_-=~/|><><><><><><><>*-*-*--*-*-*--****-*-*10101101001",

   "$!#%$&%@&^%*($&*$%^@",

   "只有1.10.3版本及以上的玩家才能看到这里的tips！...不对...为什么我不删除所有tips呢（？）",

   "其实179一直在联动",

   "是时候做一些透明方块了！",

   "我一直以为亮色边框才是最好看的，结果我用了一次黑色边框，然后...",

   "这个乱写tips的屑是179啦",

   "也只有179可以写tips了",

   "void比原版肝，大概"

   "60000p上限~",

   "我不知道void最后会有多少个种族",

   "??的系统船好难看",

   "众所周知void是捏船技术提升模组（）",

   "179的qq是1795886524（我写这个东西有什么用）",

   "需要更多的系统船！我的头发要消失了！",

   "rua!",

   "我本来很想做很多红黑配色的种族，但是为了防止种族颜色重复就改成了别的颜色。结果绿色和蓝色种族越来越多了",

   "坚钢是黑白种族！",

   "屑mod",

   "void的武器装饰都是一层一层的，看预览界面会很奇怪的",

   "人类星际联合国的炮塔装饰很水",

   "菌类×石头√",

   "菌类的每一艘船都是一个小型菌落，每一个小型菌落都由最近的，相应菌团的母巢节点控制，而母巢节点是由母巢控制的。",

   "^3金色难道不好看嘛！^7",

   "???本来是属于曙光族的，曙光族本来是属于暮光族的。",

   "???的生物不会虚接",

   "虚空之影是void里唯一一个（现在不是唯一一个了）粉色的种族（不过在虚空里的虚空之影不是粉色的）"

   "在宇宙中的虚空之影是由一只猫娘（外壳的生命体）带领的舰队",

   "按住空格键预览所有tips",

   "官方快点把按空格查看下一个tips去掉！",

   "tips不好看，去玩游戏",

   "军团有一个大母舰，菌类有一个大空间站",

   "冰族全船都被白色的冷却粘液覆盖",

   "冰族的核心里都装满了冷却粘液",

   "实际上冰族是机械种族",

   "FXTY100101是人类星际联合国某个主力舰被激活的网络系统，激活后这个网络系统拥有了自己的意识并且能够让自身在物质和信息之间随意转换。FXTY100101已经控制了空间",

   "??????的科技水平已经让舰船能够直接折跃至高维空间。",

   "???族不属于宇宙也不属于虚空，它们待在幻灭之港。",

   "幻灭之港被???和???占领",

   "复活者的装甲是其船体血量的16倍",

   "复活者的舰船被击中后只需要0.2秒就可以重组。"

   "复活者不是生物，是来自迷惘之海的高科技种族",

   "复活者的舰船命名风格很奇怪",

   "复活者几乎每一艘船都有一个全向式弹幕发射器",

   "FXTY100101的信息物质转换技术让它们的子弹可以分裂，排列和变速变色",

   "FXTY100101有一种强大的子弹护盾，部署后可以抵挡舰船与导弹的冲击",

   "FXTY100101的无人机非常可怕",

   "人类星际联合国大多高级炮塔都镶嵌了坭晶石。",

   "???族不是生物，但是舰船看起来就像是某种生物一样。",

   "泰拉族的舰船是少有的混沌风格。",

   "泰拉族的结构炮很厉害",

   "泰拉族的管理者看起来都和游戏里的boss一样",

   "每一艘泰拉族舰船都有灵灯",

   "曙光族掌握了光能，暮光族掌握了暗能。而???已经掌握了光能和暗能两种能量。",

   "光能可以使舰船的方块不会被宇宙吞噬，而暗能可以使舰船变成危险而廉价的战争机器。",

   "光与暗影合为一体就是???。",

   "暗能非常强大，足够多的暗能甚至可以直接将黑洞破坏（也可以直接破坏虚空之影的压缩奇点）。但是这样强大的暗能能量会摧毁整个???族",

   "光能能够为舰船提供足够好的装甲和适配宇宙的可重组核心。",

   "????并不来自虚空。",

   "军团曾被蜂群虐得很惨。",

   "菌类的寄生虫真的很强大！因为它们是无敌的！",

   "小心菌类领地的寄生花。",

   "???的生物只会虚接",

   "179甚至做了十几种风格的舰队（适配不同种族）",

   "光能暗能冰能离子能虚空能聚变能...",

   "我还要加更多的tips！",

   "我要先给void加几千个tips！",

   "水淼㵘",

   "xzadudu179就是XMEasurablemaximUM9",

   "冰族和FXTY100101是怎么出现的？其实都是因为子系统-膂的远征折跃到这个宇宙后产生的能量波太大了（",

   "子系统-膂远征折跃产生的能量让能量波波及到的小行星都变成了水晶并且不断组装水晶族的舰船。",

   "多看看tips",

   "看tips可比看虚空之影给你做新手教程好（）",

   "HIUN主力舰的残骸被能量波彻底毁灭了。",

   "光点召唤器？太imba了！",

   "179",

   "alphaV1.10.4更新了超级多的tips。",

   "虚空之影的教程比原版更详细！",

   "玩void建议玩生涯（？）",

   "void里很多方块都是装饰块",

   "为什么不试试用????捏红族呢？",

   "观星者？是什么",

   "神隐者是什么",

   "来源未知的虚空能量潮将这里的一些tips变成了崩坏tips",

   "虚空能量潮经过时，被能量波波及到的船都看到了一个奇怪的符号：※.还看到了极高科技的白色飞船，但当他们接近这些飞船的时候这些飞船都在一瞬间消失了。",

   "暮光族很强大但是没有光能只能在虚空摸鱼。",

   "虚空是一个拥有很多种族的 很大的世界.",

   "任何虚空的物质进入宇宙都会湮灭，任何宇宙物质进入虚空都会被虚空吞噬。而幻灭之港的任何物质都可以随意在宇宙和虚空之间穿梭，但是如果你没有光能你就无法进入幻灭之港。",

   "重组-虚空是一个拥有inf个tips的mod！",

   "重组虚空的bgm不好听，删掉吧",

   "虚空之影好蔡",

   "?",

   "??",

   "???",

   "????",

   "?????",

   "关于tips......好像没什么可以说的",

   "在tips里补充设定是最合适的水tips方式（）",

   "O-oooooooooo AAAAE-A-A-I-A-U- JO-oooooooooooo AAE-O-A-A-U-U-A- E-eee-ee-eee AAAAE-A-E....我好像写错tips了"

   "^11^22^33^44^55^66^77^88^99^00",

   "难道Reassembly不是画图嘛",

   "众所周知rea锦标赛比生涯好玩",

   "[tips]x100", --alpha V1.10.4

   "re是游戏嘛",

   "reassembly（捏船模拟器）",

   "如果你在re捏的船不够好看你就会被dalao口吐芬芳的",

   "这是什么种族？尘埃？",

   "应该没人知道我其实做过一个模仿尘埃系统船的??船吧）",

   "''毁灭者''驱逐舰的英文名是''destroyer''destroyer",

   "人类星际联合国还没有战列舰 无畏舰和母舰.（v1.10.5）",

   "???初版的母舰很难看，现在已经找不到了",

   "wwwwwwwwwwwwwwwwwwwwww",

   "复活者没了装甲就是超级大脆皮靶子",

   "冰族的冰水混合物比红族方块血量还要低",

   "冰族有最强的导弹",

   "虚空制裁者是纯原版的混族船",

   "来自^6虚空之影^7的tips：宇宙中心现在什么都没有",

   "来自^5??总部^7的tips：??太蔡了",

   "子系统-膂的工业大母舰真是吓人",

   "子系统-膂虽然折跃进来破坏了超大范围的生态，但是它们还是喜欢保护生态环境的",

   "tips不需要翻译，只需要写原文！",

   "冰族的冷却液可以给食物保鲜哦",

   "人类星际联合国经常抢冰族的液体",

   "给冰族的冷却液加一点^5不稳定的冰晶^7就能让冰族的冷却液变成超强胶水",

   "void有交流群的！但是不可能有人进群的..！嗯...",

   "菌类的菌是用菌做成的，而菌又属于菌",

   "军团使用的合成体真是硬呢",

   "军团的合成体是怎么做出来的还没有人知道",

   "虚空之影的船使用的深渊矿实际上来自幻灭之港",

   "void里有很多个世界，其中被发现的有 虚空 宇宙 幻灭之港 迷惘之海 高维空间和岛群",

   "不知道要写什么tips了！那就水（淼）一水（淼）吧",

   "我不会捏船我只会写tips",

   "???有很大的触手",

   "子系统-膂很喜欢发展工业",

   "其实坚钢是红族另一个舰队",

   "我需要工具人！",

   "琻（王金两个字左右拼起来）石真适合用来做奢华装饰呢 据说??????的货仓上都镶嵌了很多琻石",

   "科尔斯强压缩合金是??????的普通技术，但对人类星际联合国来说要研究出能和科尔斯强压缩合金强度一样高的合金已经是比登天还难的了",

   "人类星际联合国一个科学舰队过去试图偷取??????的技术时，??????带着他们的整个舰队与城市跑到了高维空间。",

   "??????某些地方的科技甚至比军团还高",

   "用聚合油和其他物质混合起来可以制作出一个爆炸范围超大，伤害为核弹数倍的炸弹。",

   "嶙矿太重了，提供的护甲也没有军团的合成体高",

   "在void里跑图或许是个很有趣的事情呢",

   "只要你的舰队船够多，没有打不过的敌人！",

   "圤（左边一个土右边一个卜）矿石就是固体燃料",

   "听说人类星际联合国很喜欢冰族",

   "如果你去观察冰族的舰船，你会看到很多半透明的管道和机械元件",

   "冰族的船是怎么造的？当然是那些带能量的冰自己拼起来的啦",

   "冰族也是AI族",

   "??????舰船的尾气严重超标",

   "???火力很强大",

   "?? ??????和人类星际联合国都是人类种族，军团人是外星人",

   "军团的建筑非常高科技",

   "人类星际联合国的船天天被??????的战斗矿机切成两段",

   "火种？",

   "zzz",

   "加载中......失败！！！！",

   "------------------------------------------------------------------------------------------------------------------------------------------",

   "听说按住空格键可以看到tips鬼畜",

   "tips难道不是抽卡系统嘛！为什么要用空格键切换！",

   "我要让你们都看不完我的tips",

   "179是大鸽子猫猫",

   "咕咕咕咕喵",

   "要是把void发出去肯定会被dalao们骂的",

   "void不imba！！强度很弱的！",

   "没有人玩void....就很可能会导致种族不平衡的",

   "咕咕咕",

   "加载中:50%\n ___________\n|                      |\n————————",

   "123456789",

   "需要更多的tips",

   "水一水",

   "其实星云物质团不是用星云做的",

   "冰族的冰块不好吃",

   "虚空之影一定是宇宙的守护者呢（指把黑洞变成压缩奇点）",

   "这个mod没做多久",

   "tips一点也不好写",

   "人类星际联合国在离开的时候把地球的很多动物与果蔬都带走了",

   "听说人类星际联合国和军团交易过奶牛",

   "不要去作死向宇宙发射信号或是去探索神秘信号源，军团的一个远征舰队就因为探索了一个位置信号源被蜂群团灭了,",

   "军团的母星在一个双恒星系统的太阳系里",

   "''子系统-膂是自然生态的守护者，它们不断优化宇宙生态，并且不断发展农业技术。它们还利用害植与????的科技做出了全新的导弹和小型炸药系统。''",

   "只要你让FXTY100101的舰队停电你就能用一艘拦截者消灭整个FXTY100101舰队！",

   "FXTY100101的船体物质看起来很好吃",

   "去????的领地会导致你的电脑爆炸",

   "虚空之影的生命体可以随意切换人设",

   "在宇宙中的虚空之影生命体很可爱",

   "据说人类星际联合国喜欢疯狂殖民",

   "菌类的船上附着的菌可以用来炖汤，听说很好吃",

   "菌类的普通菌是没有毒的！",

   "????的植物叶子很适合做饮料的装饰",

   "听说在家里种一些无害的^5????^7能够保持湿度",

   "人类星际联合国目前的母星是距地球数百光年的类地行星忒利亚，这颗漂亮的黄色行星拥有超多的生物群系，在上面每天都能看到两个太阳同时升起。",

   "忒利亚是一颗非常美丽的行星",

   "阿尔特在受到能量波冲击后变成了一颗岩石星球，上面布满了冰族的基地",

   "地球目前已经被??????的强伽马能量光束歼灭，原因未知。",

   "??????的核聚变发电机不是普通的核聚变发电机，这种发电机效率比核聚变发电机高了不少倍",

   "军团的巨型采矿舰能在100小时之内摧毁一整颗火星大小的行星",

   "军团与哨兵交易武器原料和蓝图，最终研发出了很强的武器然后就把蜂群灭了",

   "??和菌类看到军团虐杀蜂群后表示非常害怕（）",

   "呜呜呜我想不出来要写什么tips了",

   "喵",

   "alpha版本",

   "这是一条圣诞tips！",

   "冰族方块居然不会融化",

   "冰族的冷却液是白色半透明的",

   "不要试图把冰族的船体切开再把冰块放进饮料里，灵能冰可能会把你的饮料冻住（）",

   "远古虫群已经苏醒",

   "中子星的数据是什么？shape=****** points=0 features=MELEE|NOPALETTE|NOCLIP_ALLY durability=inf armor=inf meleeDamege=inf density=inf scale=10",

   "复制粘贴真好用.jpg \n            --真夏の不融の氷",

   "蔡 ???? 蔡\n            --真夏の不融の氷",

   "本mod禁止拆包（并不）",

   "9:“话说冰族真的需要冷却液吗？”\n179:“没有冷却液会升华的（）”\n179:“这样就有lifetime了（）”\n9:“wtm直接在tips里写对话（）”",

   "听说在宇宙的深处有糖族~",

   "tips越来越长了，因为越来越水了（",

   "实际上^!@#^!2有品位UR合法嗯围城日本41%25皇6帝^4回那次@武汉怒斥比吃去（179已疯）...等等为什么我乱打也能打出围城啊（）",

   "曙光族+暮光族＜???，1+1＜2~无尽曙光族=???+\n√√√√√√√√√√√√√√√√",

   "水循环",

   "????，永远的神（指电脑去世器）\n            --真夏の不融の氷",

   "听说虚空之影和虚空之影之间有一腿（）\n            --真夏の不融の氷",

   "现在的void时间是星历9658年",

   "星历9657年很多很多虫子从行星卡维斯星的地表中钻出来，瞬间毁灭了上面的人类星际联合国殖民地并且将整个星球感染成为自己的巢穴",

   "如果你暂时没法战胜真菌，别担心，鱼猫也不行\n            --鱼猫 猫 猫鱼",

   "你的179某天被吃掉了\n            --鱼猫 猫 猫鱼",

   "这条tips是因为鱼猫出现的\n            --鱼猫 猫 猫鱼",

   "鱼猫好屑，一来就把我吃掉惹",

   "博格！博格！博格！等等这个模组没有加强博格，那没事了aos爬\n            --AOS\n可能以后确实会出博格的东西（",

   "听说把糖族和冰族放在一起，然后再加上工业的激光就有冰糖葫芦了\n            --AOS",

   "啊我好水沝淼",

   "鱼猫",

   "氵+氵=水\n水+水=沝\n沝+水=淼\n淼^179=179",

   "SSSSSAYRJOETJWETGKWALRGAJWROWETWE",

   "这是一条beta0.0.6.2版本的tips!",

   "一定要把reassembly完成^1奇怪的游戏^7",

   "a"

   "捕风者过去被误认为是蜂群的一个分支",

   "捕风者跑的很快，非常快。",

   "如果你给一只捕风者喂一点R，那么你很快就会得到大量小捕风者。",

   "据说捕风者舰船的设计灵感是风筝哦~",

   "捕风者的舰船外表非常光滑，手感很好。",

   "捕风者似乎有一种巨大的母舰，可是好像没人见过。",

   "那个……要摸摸看捕风者的船吗？很光滑哦~",

   "捕风者的本体是类似哈比的粉毛有翼类人生物哦~",

   "捕风者的特产是羽绒被，而且价格非常高。",

   "由于驾驶习惯问题，捕风者经常会撞到小行星上。（话说好像每个种族都这样吧）",

   "失落者文明突兀地出现在了宇宙中，它似乎只是一片遗迹...?",

   "失落者文明很古老，精通AI技术...",

   "失落者文明从另一宇宙折跃而来",

   "宇宙中心变得愈发混乱....",

   "虚空制裁者...",

   "^1无法接收^6虚空之影^1信息的个体将不会拥有自我迭代的权限^7",
}
